Repository: ahmadreza-log/ninja-api
Catalog: languages/ninja-api-explorer-*.po
Languages: fa_ir

source: Ninja API Explorer
fa_ir: اکسپلورر API نینجا

source: A powerful WordPress plugin that provides a Swagger-like interface for exploring and testing WordPress REST APIs.
fa_ir: یک افزونه قدرتمند وردپرس که رابطی شبیه Swagger برای کاوش و تست REST API های وردپرس ارائه می‌دهد.

source: Explore, test, and document your WordPress REST API endpoints with ease.
fa_ir: به راحتی endpoint های REST API وردپرس خود را کاوش، تست و مستند کنید.

source: Total Routes
fa_ir: کل مسیرها

source: Public Routes
fa_ir: مسیرهای عمومی

source: Total Endpoints
fa_ir: کل endpoint ها

source: Namespaces
fa_ir: فضاهای نام

source: Namespace:
fa_ir: فضای نام:

source: Method:
fa_ir: متد:

source: Public Only
fa_ir: فقط عمومی

source: Search Routes
fa_ir: جستجوی مسیرها

source: Clear Filters
fa_ir: پاک کردن فیلترها

source: All Routes
fa_ir: همه مسیرها

source: Grouped Routes
fa_ir: مسیرهای گروه‌بندی شده

source: API Tester
fa_ir: تست کننده API

source: Routes by Namespace
fa_ir: مسیرها بر اساس فضاهای نام

source: routes
fa_ir: مسیر

source: Details
fa_ir: جزئیات

source: Test
fa_ir: تست

source: Copy URL
fa_ir: کپی URL

source: Path Parameters:
fa_ir: پارامترهای مسیر:

source: Query Parameters:
fa_ir: پارامترهای جستجو:

source: Example Request:
fa_ir: درخواست نمونه:

source: Example Response:
fa_ir: پاسخ نمونه:

source: Test API Endpoint
fa_ir: تست endpoint API

source: Headers:
fa_ir: هدرها:

source: Header Name
fa_ir: نام هدر

source: Header Value
fa_ir: مقدار هدر

source: Remove
fa_ir: حذف

source: Add Header
fa_ir: اضافه کردن هدر

source: Request Body:
fa_ir: بدنه درخواست:

source: Timeout (seconds):
fa_ir: زمان انقضا (ثانیه):

source: Send Request
fa_ir: ارسال درخواست

source: Cancel
fa_ir: لغو

source: Response:
fa_ir: پاسخ:

source: No routes found.
fa_ir: مسیری یافت نشد.

source: No routes found
fa_ir: مسیری یافت نشد

source: No API routes are currently registered.
fa_ir: هیچ مسیر API در حال حاضر ثبت نشده است.

source: Parameter: %s
fa_ir: پارامتر: %s

source: seconds
fa_ir: ثانیه

source: minutes
fa_ir: دقیقه

source: hours
fa_ir: ساعت

source: Execute %s request to %s endpoint
fa_ir: اجرای درخواست %s برای endpoint %s

source: Route name not found
fa_ir: نام مسیر یافت نشد

source: Failed to load route details
fa_ir: بارگذاری جزئیات مسیر ناموفق بود

source: Network error occurred while loading route details
fa_ir: خطای شبکه در حین بارگذاری جزئیات مسیر رخ داد

source: Route data not found
fa_ir: داده مسیر یافت نشد

source: URL not found
fa_ir: URL یافت نشد

source: URL copied to clipboard!
fa_ir: URL به کلیپ‌بورد کپی شد!

source: Failed to copy URL
fa_ir: کپی URL ناموفق بود

source: No text to copy
fa_ir: متنی برای کپی وجود ندارد

source: Copied to clipboard!
fa_ir: به کلیپ‌بورد کپی شد!

source: Failed to copy
fa_ir: کپی ناموفق بود

source: No route data available
fa_ir: داده مسیر موجود نیست

source: URL is required
fa_ir: URL الزامی است

source: Please enter a valid URL starting with http
fa_ir: لطفاً یک URL معتبر که با http شروع می‌شود وارد کنید

source: Test completed successfully!
fa_ir: تست با موفقیت انجام شد!

source: Test failed: %s
fa_ir: تست ناموفق بود: %s

source: Network error occurred
fa_ir: خطای شبکه رخ داد

source: Settings
fa_ir: تنظیمات

source: General Settings
fa_ir: تنظیمات عمومی

source: Enable API Testing
fa_ir: فعال کردن تست API

source: Allow users to test API endpoints directly from the interface
fa_ir: اجازه دادن به کاربران برای تست مستقیم endpoint های API از رابط

source: Default Timeout
fa_ir: زمان انقضای پیش‌فرض

source: Default timeout for API requests in seconds
fa_ir: زمان انقضای پیش‌فرض برای درخواست‌های API بر حسب ثانیه

source: Enable Request Logging
fa_ir: فعال کردن ثبت درخواست‌ها

source: Log all API test requests for debugging purposes
fa_ir: ثبت تمام درخواست‌های تست API برای اهداف دیباگ

source: Max Log Entries
fa_ir: حداکثر ورودی‌های ثبت

source: Maximum number of log entries to keep
fa_ir: حداکثر تعداد ورودی‌های ثبت برای نگهداری

source: Display Settings
fa_ir: تنظیمات نمایش

source: Routes Per Page
fa_ir: مسیرها در هر صفحه

source: Number of routes to display per page
fa_ir: تعداد مسیرها برای نمایش در هر صفحه

source: Show Public Routes Only
fa_ir: فقط مسیرهای عمومی را نمایش دهید

source: Show only publicly accessible routes by default
fa_ir: به طور پیش‌فرض فقط مسیرهای قابل دسترسی عمومی را نمایش دهید

source: Security Settings
fa_ir: تنظیمات امنیتی

source: Require Authentication
fa_ir: نیاز به احراز هویت

source: Require user authentication to access the API Explorer
fa_ir: نیاز به احراز هویت کاربر برای دسترسی به اکسپلورر API

source: Allowed User Roles
fa_ir: نقش‌های کاربری مجاز

source: Select which user roles can access the API Explorer
fa_ir: انتخاب کنید که کدام نقش‌های کاربری می‌توانند به اکسپلورر API دسترسی داشته باشند

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Reset to Defaults
fa_ir: بازنشانی به پیش‌فرض

source: Export Settings
fa_ir: صادرات تنظیمات

source: Import Settings
fa_ir: واردات تنظیمات

source: Settings saved successfully!
fa_ir: تنظیمات با موفقیت ذخیره شد!

source: Settings reset to defaults!
fa_ir: تنظیمات به پیش‌فرض بازنشانی شد!

source: Invalid settings file format
fa_ir: فرمت فایل تنظیمات نامعتبر

source: Documentation
fa_ir: مستندات

source: API Explorer Documentation
fa_ir: مستندات اکسپلورر API

source: Getting Started
fa_ir: شروع کار

source: How to Use
fa_ir: نحوه استفاده

source: Features
fa_ir: ویژگی‌ها

source: Troubleshooting
fa_ir: عیب‌یابی

source: Support
fa_ir: پشتیبانی

source: Changelog
fa_ir: تاریخچه تغییرات

source: Insufficient permissions
fa_ir: مجوزهای ناکافی
